In [1]:
import pandas as pd

In [2]:
'''Series – like a column in Excel

It’s a single list of data with an index.
'''
df= pd.Series([10,20,30,40])
print(df)
print(type(df))
df=pd.DataFrame(df)
print(df)
print(type(df))

0    10
1    20
2    30
3    40
dtype: int64
<class 'pandas.core.series.Series'>
    0
0  10
1  20
2  30
3  40
<class 'pandas.core.frame.DataFrame'>

In [61]:
data ={ 
    'Name' : ['Alice', 'Bob', 'Charlie'],
    'Age' : [ 25,30,35],
    'City':['NY','LA','Chicago']
}

In [62]:
print(type(data))
print(data)

<class 'dict'>
{'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['NY', 'LA', 'Chicago']}

In [63]:
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago
<class 'pandas.core.frame.DataFrame'>

In [6]:
#series
s=df['Name']
print(type(s)) #give series 
s=df[['Name']]
print(type(s)) # gives DataFrame

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [7]:
df['Age']

0    25
1    30
2    35
Name: Age, dtype: int64

In [8]:
df[['Age','City']]

   Age     City
0   25       NY
1   30       LA
2   35  Chicago

In [9]:
#Filter rows (like SQL WHERE):
s=df['Age'] >28

print(df[s])
s=pd.Series([False,False,True])

print(df[s])

s=pd.Series([False,False,True,True])
print(df[s])

      Name  Age     City
1      Bob   30       LA
2  Charlie   35  Chicago
      Name  Age     City
2  Charlie   35  Chicago

<ipython-input-9-626f2f58cca9>:10: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  print(df[s])

      Name  Age     City
2  Charlie   35  Chicago

In [10]:
df[df['Age']>28]

      Name  Age     City
1      Bob   30       LA
2  Charlie   35  Chicago

In [11]:
df[df['Name']=='Bob']
df.loc[df['Name']!='Bob']

      Name  Age     City
0    Alice   25       NY
2  Charlie   35  Chicago

In [12]:
df.loc[(df['Name']!='Bob'),['Name','Age']]# For Loc - first value is filter , other values are column names

      Name  Age
0    Alice   25
2  Charlie   35

In [13]:
#multiple conditon  -with logical operators (&,|,~)

df

df[ ~(df['Name']=='Bob') & (df['Age']<=30) |(df['City']=='Ny')]

    Name  Age City
0  Alice   25   NY

In [14]:
age_filter= [20,23,24,25,30]
df_Filter=df[df['Age'].isin(age_filter)]
city=['TX','LA','NY']
df_Filter2=df_Filter[df_Filter['City'].isin(city)]
df_Filter2

    Name  Age City
0  Alice   25   NY
1    Bob   30   LA

In [15]:
df['Age']

0    25
1    30
2    35
Name: Age, dtype: int64

In [16]:
#df.loc[<row_condition>, <columns_to_return>].sort_values(by=<column>, ascending=<True/False>)

In [17]:
df.loc[~(df['Name']=='Bob'),['Name','Age']].sort_values(by='Age',ascending= False)

      Name  Age
2  Charlie   35
0    Alice   25

In [18]:
df.iloc[0,[1,2]]

Age     25
City    NY
Name: 0, dtype: object

In [19]:
df

      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago

In [20]:
df.loc[[0,1], ['Name','Age']]

    Name  Age
0  Alice   25
1    Bob   30

In [21]:
df.loc[:, ['Name','Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [22]:
df.loc[0:2,['Name','City']]
df.iloc[:,0:2]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [23]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [24]:
df.shape

(3, 3)

In [25]:
df['Age'].value_counts()

Age
25    1
30    1
35    1
Name: count, dtype: int64

In [26]:
df.index.is_unique

True

In [27]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [66]:
df['Email']=[ 'sai@gmail.com','sai@gmail.com','Charan@gmail.com']

In [29]:
df

      Name  Age     City             Email
0    Alice   25       NY     sai@gmail.com
1      Bob   30       LA     sai@gmail.com
2  Charlie   35  Chicago  Charan@gmail.com

In [30]:
df.set_index('Email',inplace=True)

In [31]:
df.index

Index(['sai@gmail.com', 'sai@gmail.com', 'Charan@gmail.com'], dtype='object', name='Email')

In [32]:
df.sort_index(ascending=False, inplace=True)
df

                     Name  Age     City
Email
sai@gmail.com       Alice   25       NY
sai@gmail.com         Bob   30       LA
Charan@gmail.com  Charlie   35  Chicago

In [33]:
df.reset_index(inplace=True)

In [34]:
df

              Email     Name  Age     City
0     sai@gmail.com    Alice   25       NY
1     sai@gmail.com      Bob   30       LA
2  Charan@gmail.com  Charlie   35  Chicago

In [35]:
#Updatinng rows-cols
df
#

              Email     Name  Age     City
0     sai@gmail.com    Alice   25       NY
1     sai@gmail.com      Bob   30       LA
2  Charan@gmail.com  Charlie   35  Chicago

In [38]:
# if we want to change for all the columns names
df.columns=['Email','full name', 'Age','City']
df.columns

Index(['Email', 'full name', 'Age', 'City'], dtype='object')

In [39]:
# if we wanted to change for particular column values we use the rename option as 
df.rename(columns={'full name':'Name','City':'Loc'},inplace=True)
df

              Email     Name  Age      Loc
0     sai@gmail.com    Alice   25       NY
1     sai@gmail.com      Bob   30       LA
2  Charan@gmail.com  Charlie   35  Chicago

In [40]:
#df.columns=[ c.upper() for c in df.columns]
df

              Email     Name  Age      Loc
0     sai@gmail.com    Alice   25       NY
1     sai@gmail.com      Bob   30       LA
2  Charan@gmail.com  Charlie   35  Chicago

              Email     Name  Age      Loc
0     sai@gmail.com    Alice   25       NY
1     sai@gmail.com      Bob   28       LA
2  Charan@gmail.com  Charlie   35  Chicago

In [72]:
df=df1
df1=df

#updating rows

#want to update age of Bob age to 28

df.loc[1]=['sai@gmail.com','Bob',28,'LA']	
print(df)
#want to update age of Bob age to 30
df.at[1,'Age']=30
print(df)
df.loc[(df['Email']=='sai@gmail.com')& (df['Name']=='Bob'),'Age']=28
print(df)

df.loc[(df['Email']=='sai@gmail.com') & (df['Name']=='Bob'),['Age','Email']]=[30,'bob@gmail.com']
print(df)

            Name  Age     City             Email
0          Alice   25       NY     sai@gmail.com
1  sai@gmail.com  Bob       28                LA
2        Charlie   35  Chicago  Charan@gmail.com
            Name Age     City             Email
0          Alice  25       NY     sai@gmail.com
1  sai@gmail.com  30       28                LA
2        Charlie  35  Chicago  Charan@gmail.com
            Name Age     City             Email
0          Alice  25       NY     sai@gmail.com
1  sai@gmail.com  30       28                LA
2        Charlie  35  Chicago  Charan@gmail.com
            Name Age     City             Email
0          Alice  25       NY     sai@gmail.com
1  sai@gmail.com  30       28                LA
2        Charlie  35  Chicago  Charan@gmail.com

In [73]:
df['Email']=df['Email'].str.lower()
df

            Name Age     City             Email
0          Alice  25       NY     sai@gmail.com
1  sai@gmail.com  30       28                la
2        Charlie  35  Chicago  charan@gmail.com

In [ ]:
# apply map applymap replace